#数组是同一类型的集合，矩阵matrix其实就是一个二维数组
#向量 一维数组
#矩阵 二维数组
#数组 >=1维数组

#array(data = NA, dim = length(data), dimnames = NULL)
#data 指定数组的数据源，可以是一个向量、矩阵或列表
#dim 指定数据的维度
#dimnames 可选参数，指定每个维度的名称

##在R中，可以使用矩阵(Matrix)或列表(List)来表示多维数组
# 创建一个3x3的矩阵
matrix(c(1, 2, 3, 4, 5, 6, 7, 8, 9), nrow = 3, ncol = 3)
# 创建一个包含矩阵和向量的列表
list(matrix(c(1, 2, 3, 4), nrow = 2), c(5, 6, 7))
# 使用array()函数
array(c(1, 2, 3, 4), dim = c(4)) #dim这里是一维 1 2 3 4

col.names = c("Col1", "Col2", "Col3")
row.names = c("Row1", "Row2", "Row3")
matrix.names = c("Matrix1", "Matrix2")
array(c(c(5, 9, 3), c(10, 11, 12, 13, 14, 15)), dim = c(3, 3, 2), dimnames = list(col.names, row.names, matrix.names))
#, , 1                                , , Matrix1
#      [,1] [,2] [,3]                       Row1 Row2 Row3
#[1,]    5   10   13                  Col1    5   10   13
#[2,]    9   11   14                  Col2    9   11   14
#[3,]    3   12   15                  Col3    3   12   15

#, , 2                                , , Matrix2
#      [,1] [,2] [,3]                       Row1 Row2 Row3
#[1,]    5   10   13                  Col1    5   10   13
#[2,]    9   11   14                  Col2    9   11   14
#[3,]    3   12   15                  Col3    3   12   15

array(c(c(5, 9, 3), c(10, 11, 12, 13, 14, 15, 16, 17, 18)), dim = c(3,3,2))
#, , 1
#      [,1] [,2] [,3]
#[1,]    5   10   13
#[2,]    9   11   14
#[3,]    3   12   15
#, , 2
#      [,1] [,2] [,3]
#[1,]   16    5   10
#[2,]   17    9   11
#[3,]   18    3   12




#访问数组元素
my_array = array(1:18, dim = c(2, 3, 3)) #创建一个2x3x2的三维数组
#, , 1
#      [,1] [,2] [,3]
#[1,]    1    3    5
#[2,]    2    4    6

#, , 2
#      [,1] [,2] [,3]
#[1,]    7    9   11
#[2,]    8   10   12

#, , 3
#      [,1] [,2] [,3]
#[1,]   13   15   17
#[2,]   14   16   18

my_array[1, 2, 3]  #15 访问第3层第1行第2列的元素
my_array[c(1, 2), c(2, 3), c(1, 2)] == my_array[1:2, 2:3, 1:2]
#, , 1
#      [,1] [,2]
#[1,]    3    5
#[2,]    4    6
#, , 2
#      [,1] [,2]
#[1,]    9   11
#[2,]   10   12
my_array[1,,]
#      [,1] [,2] [,3]
#[1,]    1    7   13
#[2,]    3    9   15
#[3,]    5   11   17
my_array[,1,]
#      [,1] [,2] [,3]
#[1,]    1    7   13
#[2,]    2    8   14
my_array[,,1]
#      [,1] [,2] [,3]
#[1,]    1    3    5
#[2,]    2    4    6
my_array[my_array > 10] #11 12 13 14 15 16 17 18


#apply(X, MARGIN, FUN, ...)函数
#X 表示数据
#MARGIN 1表示行，2表示列，c(1, 2)表示同时应用于行与列
# 创建一个3x3的矩阵
my_matrix <- matrix(1:9, nrow = 3)
#      [,1] [,2] [,3]
#[1,]    1    4    7
#[2,]    2    5    8
#[3,]    3    6    9
# 对每行应用sum函数
apply(my_matrix, 1, sum) #12 15 18
# 对每列应用sum函数
apply(my_matrix, 2, sum) #6 15 24

# 创建一个3维数组
my_array2 <- array(1:12, dim = c(2, 3, 2))
#, , 1
#       [,1] [,2] [,3]
#[1,]    1    3    5
#[2,]    2    4    6
#, , 2
#       [,1] [,2] [,3]
#[1,]    7    9   11
#[2,]    8   10   12
# 对第1个和第3个维度同时应用mean函数
apply(my_array2, c(1, 3), mean)
#       [,1] [,2]
#[1,]    3    9
#[2,]    4   10



