#赋值
a <- 123 # 最新的R版本也支持=
b <- 456
print(a + b) #579

#数学运算符
# 优先级   符号    含义
#   1       ()     括号
#   2       ^      乘方
#   3       %%     整除求余
#           %/%    整除
#   4       *      乘法
#           /      除法
#   5       +      加法
#           -      减法
1 + 2 * 3    #7
(1 + 2) * 3  #9
3 / 4        #0.75
4.4 / 0.5    #8.8
3 %/% 4      #0
4.4 %/% 0.5  #8
10 %% 3      #1
10 %% 2      #0
3.2 %% 2     #1.2
5 ^ 2        #25
5 ^ 3        #125
25 ^ 0.5     #5
2 ^ 2.5      #5.656854

#关系运算符
# 运算符     描述
#   >
#   <
#   ==
#   !=
#   >=
#   <=
5 > 2        #TRUE
v <- c(2,4,6,9)
t <- c(1,4,7,9)
v>t          #TRUE FALSE FALSE FALSE

#逻辑运算符
# 运算符      描述
#   &         逻辑与,作用于向量的每一个元素
#   |         逻辑或,作用于向量的每一个元素
#   !         逻辑非,作用于向量的每一个元素
#   &&        逻辑与,作用于向量的第一个元素
#   ||        逻辑或,作用于向量的第一个元素
m <- c(3,0,TRUE,2+2i)
n <- c(1,3,TRUE,2+3i)
m&n          #TRUE FALSE  TRUE  TRUE
m|n          #TRUE TRUE TRUE TRUE
!m           #FALSE  TRUE FALSE FALSE
#m&&n
#m||n
5 && 3       #TRUE
5 && 0       #FALSE

#赋值运算符
# 运算符           描述
#   <-
#   =              向左赋值
#   <<-
#
#   ->
#   ->>            向右赋值

#其他运算符
# 运算符     描述
#   :       用于创建一系列数字的向量
#  %in%     用于判断元素是否在向量里，返回布尔值
#  %*%      用于矩阵与它转置的矩阵相乘
arr1_10 = 1:10
print(arr1_10)  #1  2  3  4  5  6  7  8  9  10
5 %in% arr1_10  #TRUE
15 %in% arr1_10 #FALSE


#数学函数
#sqrt(n)       n的平方根
sqrt(16)      #4
sqrt(10)      #3.162278
#exp(n)        自然常数e的n次方
exp(1)        #2.718282
exp(2)        #7.389056
#log(m, n)     n的几次方等于m
log(9, 3)     #2
log(27, 3)    #3
#log10(m)      即log(m, 10)
log10(1000)   #3
#round(n)      对n进行四舍五入取整
round(3.49)   #3
round(3.5)    #4
round(3.51)   #4
round(4.49)   #4
round(4.5)    #4 #这个比较特殊
round(4.51)   #5
round(4.52)   #5
round(5.49)   #5
round(5.5)    #6
round(5.51)   #6
#round(n, m)   对n保留m位小数后四舍五入取整
round(3.14159, 3) #3.142
round(3.14149, 3) #3.141
#ceiling(n)    对n向上取整
ceiling(3.4)  #4
ceiling(3.8)  #4
#floor(n)      对n向下取整
floor(3.4)    #3
floor(3.8)    #3
sin(pi/6)     #0.5
cos(pi/4)     #0.7071068
tan(pi/3)     #1.732051
asin(0.5)     #0.5235988 即pi/6
acos(0.7071068)  #0.7853981 即pi/4
atan(1.732051)   #1.047198 即pi/3
dnorm(0)         #0.3989423 概率密度函数
pnorm(0)         #0.5 概率密度积分函数
qnorm(0.95)      #1.644854 分位数函数
rnorm(3, 5, 2)   #产生3个平均值为5，标准差为2的正态随机数